<a href="https://colab.research.google.com/github/Saurav-Raghaw/DataScience/blob/main/LinearRegression_Pytorch.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas Functions for Data Analysis and Manipulation.

##Importing the Liabraries.

In [2]:
import numpy as np   
import pandas as pd    
import matplotlib.pyplot as plt

##Loading and Reviewing the data.

In [3]:
df = pd.read_csv("auto-mpg.csv")  
df.shape #rows and columns

(398, 9)

In [5]:
df.head() #Top 5 rows

#There is a “tail()” method as well which will show the last 5 rows from our data set.

    mpg  cyl   disp   hp    wt   acc  yr  origin                   car name
0  18.0    8  307.0  130  3504  12.0  70       1  chevrolet chevelle malibu
1  15.0    8  350.0  165  3693  11.5  70       1          buick skylark 320
2  18.0    8  318.0  150  3436  11.0  70       1         plymouth satellite
3  16.0    8  304.0  150  3433  12.0  70       1              amc rebel sst
4  17.0    8  302.0  140  3449  10.5  70       1                ford torino

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mpg       398 non-null    float64
 1   cyl       398 non-null    int64
 2   disp      398 non-null    float64
 3   hp        398 non-null    object
 4   wt        398 non-null    int64
 5   acc       398 non-null    float64
 6   yr        398 non-null    int64
 7   origin    398 non-null    int64
 8   car name  398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [7]:
#Using “isnull()” and “sum()” functions, we can find that the no. of null values in a DataFrame for every feature.

df.isnull().sum()

mpg         0
cyl         0
disp        0
hp          0
wt          0
acc         0
yr          0
origin      0
car name    0
dtype: int64

In [8]:
#drop()

df.drop(['car name'], axis=1, inplace=True) #“inplace=True’ to modify the current DataFrame.

In [9]:
df.head()

    mpg  cyl   disp   hp    wt   acc  yr  origin
0  18.0    8  307.0  130  3504  12.0  70       1
1  15.0    8  350.0  165  3693  11.5  70       1
2  18.0    8  318.0  150  3436  11.0  70       1
3  16.0    8  304.0  150  3433  12.0  70       1
4  17.0    8  302.0  140  3449  10.5  70       1

In [11]:
#Replacing the categorical variable with actual values.
df['origin'] = df['origin'].replace({1: 'america', 2: 'europe', 3: 'asia'})
df.head()

    mpg  cyl   disp   hp    wt   acc  yr   origin
0  18.0    8  307.0  130  3504  12.0  70  america
1  15.0    8  350.0  165  3693  11.5  70  america
2  18.0    8  318.0  150  3436  11.0  70  america
3  16.0    8  304.0  150  3433  12.0  70  america
4  17.0    8  302.0  140  3449  10.5  70  america

In [12]:
#describe()
#using the “describe()” function, we can get various information about the numerical columns in our DataFrame, 
#such as total count of rows, mean, the minimum value, the maximum value, and the spread of the values in the particular feature.

df.describe()

#hp in not nummerical.

              mpg         cyl        disp           wt         acc          yr
count  398.000000  398.000000  398.000000   398.000000  398.000000  398.000000
mean    23.514573    5.454774  193.425879  2970.424623   15.568090   76.010050
std      7.815984    1.701004  104.269838   846.841774    2.757689    3.697627
min      9.000000    3.000000   68.000000  1613.000000    8.000000   70.000000
25%     17.500000    4.000000  104.250000  2223.750000   13.825000   73.000000
50%     23.000000    4.000000  148.500000  2803.500000   15.500000   76.000000
75%     29.000000    8.000000  262.000000  3608.000000   17.175000   79.000000
max     46.600000    8.000000  455.000000  5140.000000   24.800000   82.000000

In [13]:
#value_counts()
#“value_counts()” function is used to identify the different 
#categories in a feature as well as the count of values per category.

df['origin'].value_counts()

america    249
asia        79
europe      70
Name: origin, dtype: int64

In [15]:
#sample()
#We can use the “sample()” function which allows us to choose random values from our data frame. 
#We can pass it the no. of rows that we want to fetch as a parameter.
df.sample(6)

      mpg  cyl   disp   hp    wt   acc  yr   origin
313  28.0    4  151.0   90  2678  16.5  80  america
43   13.0    8  400.0  170  4746  12.0  71  america
269  30.9    4  105.0   75  2230  14.5  78  america
343  39.1    4   79.0   58  1755  16.9  81     asia
35   17.0    6  250.0  100  3329  15.5  71  america
280  21.5    6  231.0  115  3245  15.4  79  america

In [16]:
#nunique()
#We can use the “nunique()” function to find the no. of unique values in our series or data frame. 
#Generally, it is used in the case of categorical features to identify the no. of categories in a particular feature.

df['origin'].nunique()

3

In [17]:
#columns
#As the name suggests, “columns” get the name of all the features/columns in our data frame.

df.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'wt', 'acc', 'yr', 'origin'], dtype='object')

In [18]:
#nsmallest() & nlargest()
#So, as the name suggests, “nsmallest() & nlargest()” functions are used to 
#obtain “n” no. of rows from our dataset which are lowest or highest respectively.

df.nsmallest(4, 'mpg')

     mpg  cyl   disp   hp    wt   acc  yr   origin
28   9.0    8  304.0  193  4732  18.5  70  america
25  10.0    8  360.0  215  4615  14.0  70  america
26  10.0    8  307.0  200  4376  15.0  70  america
27  11.0    8  318.0  210  4382  13.5  70  america

In [19]:
df.nlargest(4, 'mpg')

      mpg  cyl  disp  hp    wt   acc  yr  origin
322  46.6    4  86.0  65  2110  17.9  80    asia
329  44.6    4  91.0  67  1850  13.8  80    asia
325  44.3    4  90.0  48  2085  21.7  80  europe
394  44.0    4  97.0  52  2130  24.6  82  europe

https://www.analyticsvidhya.com/blog/2021/03/pandas-functions-for-data-analysis-and-manipulation/